w8d1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("description", "title", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "so much fun"], ["title", "app academy"], ["moderator_id", 2], ["created_at", "2020-07-20 20:12:51.799017"], ["updated_at", "2020-07-20 20:12:51.799017"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save!