w11d5/benchbnb/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
    def index
        @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "fun bench"], ["lat", 37.743565], ["lng", -122.452037], ["created_at", "2020-08-14 18:21:34.197342"], ["updated_at", "2020-08-14 18:21:34.197342"]]
---
    def create
        @bench = Bench.new(bench_params)
        if @bench.save