w6d3/first_routes_and_controllers2/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sokka"], ["email", "nobending@avatar.com"], ["created_at", "2020-07-08 23:29:53.733672"], ["updated_at", "2020-07-08 23:29:53.733672"]]

    def update
        user = User.find(params[:id])
        if user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "notabender@avatar.com"], ["updated_at", "2020-07-08 23:49:27.027212"], ["id", 4]]