w6d4/first_routes_and_controllers2/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
      artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.rocks1.com"], ["updated_at", "2020-07-09 21:05:15.187815"], ["id", 6]]
---
    def update
      artwork = Artwork.find_by(id: params[:id])

      if artwork
        if artwork.update(artwork_params)