w6d4/first_routes_and_controllers2/app/controllers/users_controller.rb

    def index
        # user = User.find(params[:user_id]) try to add search
        users = User.all
---
SELECT "users".* FROM "users"

    def update
        user = User.find_by(id: params[:id])
        if !user.nil?
            if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "arrowhead@avatar.com"], ["updated_at", "2020-07-09 16:59:51.830029"], ["id", 2]]