w11d3/benchbnb/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uQW44Zda44h_bbSxicok_Q"], ["updated_at", "2020-08-12 21:58:56.645196"], ["id", 2]]