w6d5/ALotOfCats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id])